In [1]:
%run "../LOS.ipynb"

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [16]:
df = dreams_mastersheet

In [17]:
date_du_jour = datetime.today().strftime("%d_%m_%Y")

# La cohort des beneficaires

In [18]:
base = df[
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
    &(df.timeOn_system=="required_Time_on")
]
base.code.count()

18882

In [19]:
base_table = base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           904     796     653     281           5036         7670
15-19           979     670     358     163           5216         7386
20-24           513     328     163      66           2756         3826
Grand Total    2396    1794    1174     510          13008        18882

# curriculum

In [20]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

15723

In [21]:
curriculum_table = curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           717     609     534     179           4301         6340
15-19           780     497     299     124           4454         6154
20-24           399     258     116      50           2406         3229
Grand Total    1896    1364     949     353          11161        15723

# Condoms

In [22]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

3215

3451

In [23]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     101      42      24            224          473
15-19           304     170     110      53            970         1607
20-24           236      89      49      22            739         1135
Grand Total     622     360     201      99           1933         3215

In [24]:
condoms_table = new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
condoms_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     106      83      45            240          556
15-19           318     202     132      55           1005         1712
20-24           247     112      54      22            748         1183
Grand Total     647     420     269     122           1993         3451

# depistage VIH

In [25]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

1964

In [26]:
depistage_table = vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            33      10      21       1            386          451
15-19            89      25      26       4            648          792
20-24           154      24      31       6            506          721
Grand Total     276      59      78      11           1540         1964

# Post Care Treatment

In [27]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

86

In [28]:
pvc_table = post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
pvc_table

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             3       0             16           19
15-19             3       1             36           40
20-24             0       0             27           27
Grand Total       6       1             79           86

# socio economique Approche

In [29]:
combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

Combin_socio_eco.code.count()

NameError: name 'Combin_socio_eco' is not defined

In [ ]:
cse_table= combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
cse_table

fiscal_year  Q3fy20-Q4fy20  Grand Total
age_range
10-14                  125          125
15-19                  134          134
20-24                  118          118
Grand Total            377          377

# PREP

In [ ]:
prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

34

In [ ]:
prep_table = prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_table

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0              4            4
15-19             4       0             10           14
20-24             6       2              8           16
Grand Total      10       2             22           34

In [ ]:
prep_sens = base[
    (base.sens_prep=="tested_on_given_date")
]
prep_sens.code.count()

488

In [ ]:
prep_sens_table = prep_sens.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_sens_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       1       6       0             14           22
15-19            45      16      37       0             72          170
20-24           114      15      33       3            131          296
Grand Total     160      32      76       3            217          488

# Primary Services

In [ ]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

6324

1511

1058

In [ ]:
ps14_table = ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps14_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           716     605     526     166           4311         6324
Grand Total     716     605     526     166           4311         6324

In [ ]:

ps19_table= ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps19_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
15-19           289     161     124      25            912         1511
Grand Total     289     161     124      25            912         1511

In [ ]:
ps24_table = ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps24_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
20-24           221      92      40       8            697         1058
Grand Total     221      92      40       8            697         1058

# reporting

In [ ]:
table_report = pd.ExcelWriter(f"DREAMS_services_Quarter_enroled_{date_du_jour}.xlsx",engine="xlsxwriter")
ps14_table.to_excel(table_report,sheet_name="ps14_table",index=True,na_rep="NULL")
ps19_table.to_excel(table_report,sheet_name="ps19_table",index=True,na_rep="NULL")
ps24_table.to_excel(table_report,sheet_name="ps24_table",index=True,na_rep="NULL")
prep_table.to_excel(table_report,sheet_name="prep_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
cse_table.to_excel(table_report,sheet_name="cse_table",index=True,na_rep="NULL")
pvc_table.to_excel(table_report,sheet_name="pvc_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
condoms_table.to_excel(table_report,sheet_name="condoms_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
curriculum_table.to_excel(table_report,sheet_name="curriculum_table",index=True,na_rep="NULL")
base_table.to_excel(table_report,sheet_name="base_table",index=True,na_rep="NULL")
table_report.save()